# Gözlem ve Değişken Seçimi : loc ve iloc

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    17     4     4
1    23    15     1
2    11    24    14
3    10    25     6
4    17    18    16
5    12    13     7
6     8    12     5
7    15    12     3
8     3     8     6
9     2    26    14

In [3]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [4]:
df.loc[0:3]

   var1  var2  var3
0    17     4     4
1    23    15     1
2    11    24    14
3    10    25     6

In [5]:
#iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [7]:
df.iloc[0:3]

   var1  var2  var3
0    17     4     4
1    23    15     1
2    11    24    14

In [8]:
df.iloc[0,0]

17

In [9]:
df

   var1  var2  var3
0    17     4     4
1    23    15     1
2    11    24    14
3    10    25     6
4    17    18    16
5    12    13     7
6     8    12     5
7    15    12     3
8     3     8     6
9     2    26    14

In [11]:
df.iloc[:3:,:2]

   var1  var2
0    17     4
1    23    15
2    11    24

In [12]:
df.loc[0:3, "var3"]

0     4
1     1
2    14
3     6
Name: var3, dtype: int32

Eğer değişken yada gözlem birimleri yani satırlar ile mutlak bir değer işaretlemesi yapacak ise;
**loc** tercih edilmelidir.Aynı işlemi iloc kullanarak yapsaydık hata alacaktık.

In [19]:
df.iloc[0:3, 1:3]

   var2  var3
0     4     4
1    15     1
2    24    14

In [20]:
df.iloc[0:3]

   var1  var2  var3
0    17     4     4
1    23    15     1
2    11    24    14

In [21]:
df.iloc[0:3]["var3"]

0     4
1     1
2    14
Name: var3, dtype: int32